read_verilog -sv verilog/insecure_modules/Divide.v verilog/insecure_modules/gcd.v verilog/insecure_modules/KeyGen.v verilog/insecure_modules/Mult.v verilog/insecure_modules/RSA_decrypt.v verilog/insecure_modules/RSA_encrypt.v verilog/RSA.v
prep -top RSA
flatten
techmap
aigmap
write_verilog flattened/RSA.v